stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Src/stm32u3xx_ll_rcc.c
      case LL_RCC_SPI1_CLKSOURCE_PCLK2:  /* SPI1 Clock is PCLK2 */
        SPI_frequency = RCC_GetPCLK2ClockFreq(RCC_GetHCLKClockFreq(RCC_GetSystemClockFreq()));
        break;

      default:
        /* unreachable code */
        break;
    }
  }
  else if (SPIxSource == LL_RCC_SPI2_CLKSOURCE)
  {
    /* SPI1 CLK clock frequency */
    switch (LL_RCC_GetSPIClockSource(SPIxSource))
    {
      case LL_RCC_SPI2_CLKSOURCE_MSIK: /* SPI2 Clock is MSIK */
        if (LL_RCC_MSIK_IsReady() != 0U)
        {
          SPI_frequency = RCC_GetMSIKClockFreq();
        }
        break;

      case LL_RCC_SPI2_CLKSOURCE_PCLK1:  /* SPI2 Clock is PCLK1 */
        SPI_frequency = RCC_GetPCLK1ClockFreq(RCC_GetHCLKClockFreq(RCC_GetSystemClockFreq()));
        break;

      default:
        /* unreachable code */
        break;
    }
  }
#if defined (SPI4)
  else if (SPIxSource == LL_RCC_SPI4_CLKSOURCE)
  {
    /* SPI4 CLK clock frequency */
    switch (LL_RCC_GetSPIClockSource(SPIxSource))
    {
      case LL_RCC_SPI4_CLKSOURCE_MSIK: /* SPI3 Clock is MSIK */
        if (LL_RCC_MSIK_IsReady() != 0U)
        {
          SPI_frequency = RCC_GetMSIKClockFreq();
        }
        break;

      case LL_RCC_SPI4_CLKSOURCE_PCLK1:  /* SPI3 Clock is PCLK1 */
        SPI_frequency = RCC_GetPCLK1ClockFreq(RCC_GetHCLKClockFreq(RCC_GetSystemClockFreq()));
        break;

      default:
        /* unreachable code */
        break;
    }
  }
#endif /* SPI4 */
  else /*if (SPIxSource == LL_RCC_SPI3_CLKSOURCE)*/
  {
    /* SPI3 CLK clock frequency */
    switch (LL_RCC_GetSPIClockSource(SPIxSource))
    {
      case LL_RCC_SPI3_CLKSOURCE_MSIK: /* SPI3 Clock is MSIK */
        if (LL_RCC_MSIK_IsReady() != 0U)
        {
          SPI_frequency = RCC_GetMSIKClockFreq();
        }
        break;

      case LL_RCC_SPI3_CLKSOURCE_PCLK1:  /* SPI3 Clock is PCLK1 */
        SPI_frequency = RCC_GetPCLK1ClockFreq(RCC_GetHCLKClockFreq(RCC_GetSystemClockFreq()));
        break;

      default:
        /* unreachable code */
        break;
    }
  }

  return SPI_frequency;
}

/**
  * @brief  Return OCTOSPIx clock frequency
  * @param  OCTOSPIxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_OCTOSPI_CLKSOURCE
  * @retval OCTOSPI clock frequency (in Hz)
  *         - @ref  LL_RCC_PERIPH_FREQUENCY_NO indicates error
  */
uint32_t LL_RCC_GetOCTOSPIClockFreq(uint32_t OCTOSPIxSource)
{
  uint32_t OCTOSPI_frequency = LL_RCC_PERIPH_FREQUENCY_NO;

  assert_param(IS_LL_RCC_OCTOSPI_CLKSOURCE(OCTOSPIxSource));

  /* OCTOSPI CLK clock frequency */
  switch (LL_RCC_GetOCTOSPIClockSource(OCTOSPIxSource))
  {
    case LL_RCC_OCTOSPI_CLKSOURCE_SYSCLK: /* OCTOSPI Clock is SYSCLK */
      OCTOSPI_frequency = RCC_GetSystemClockFreq();
      break;

    case LL_RCC_OCTOSPI_CLKSOURCE_MSIK:  /* OCTOSPI Clock is MSIK */
      if (LL_RCC_MSIK_IsReady() != 0U)
      {
        OCTOSPI_frequency = RCC_GetMSIKClockFreq();
      }
      break;

    default:
      /* unreachable code */
      break;
  }
  return OCTOSPI_frequency;
}

/**
  * @brief  Return FDCANx clock frequency
  * @param  FDCANxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_FDCAN_CLKSOURCE
  * @retval FDCAN clock frequency (in Hz)
  *         - @ref  LL_RCC_PERIPH_FREQUENCY_NO indicates error
  */
uint32_t LL_RCC_GetFDCANClockFreq(uint32_t FDCANxSource)
{
  uint32_t FDCAN_frequency = LL_RCC_PERIPH_FREQUENCY_NO;

  assert_param(IS_LL_RCC_FDCAN_CLKSOURCE(FDCANxSource));

  /* FDCAN CLK clock frequency */
  switch (LL_RCC_GetFDCANClockSource(FDCANxSource))
  {
    case LL_RCC_FDCAN_CLKSOURCE_SYSCLK: /* FDCAN Clock is SYSCLK */
      FDCAN_frequency = RCC_GetSystemClockFreq();
      break;

    case LL_RCC_FDCAN_CLKSOURCE_MSIK:  /* FDCAN Clock is MSIK */
      if (LL_RCC_MSIK_IsReady() != 0U)
      {
        FDCAN_frequency = RCC_GetMSIKClockFreq();
      }
      break;

    default:
      /* unreachable code */
      break;
  }
  return FDCAN_frequency;
}

/**
  * @brief  Return USBx clock frequency
  * @param  USBxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_USB1_CLKSOURCE
  * @retval USB clock frequency (in Hz)
  *         - @ref  LL_RCC_PERIPH_FREQUENCY_NO indicates error
  */
uint32_t LL_RCC_GetUSBClockFreq(uint32_t USBxSource)
{
  uint32_t usb_frequency = LL_RCC_PERIPH_FREQUENCY_NO;

  assert_param(IS_LL_RCC_USB_CLKSOURCE(USBxSource));

  /* USB CLK clock frequency */
  switch (LL_RCC_GetICLKClockSource(LL_RCC_ICLK_CLKSOURCE))
  {
    case LL_RCC_ICLK_CLKSOURCE_SYSCLK: /* USB Clock is SYSCLK */
      usb_frequency = RCC_GetSystemClockFreq();
      break;

    case LL_RCC_ICLK_CLKSOURCE_MSIK:  /* USB Clock is MSIK */
      if (LL_RCC_MSIK_IsReady() != 0U)
      {
        usb_frequency = RCC_GetMSIKClockFreq();
      }
      break;

    case LL_RCC_ICLK_CLKSOURCE_HSI48:  /* USB Clock is HSI48 */
      if (LL_RCC_HSI48_IsReady() != 0U)
      {
        usb_frequency = HSI48_VALUE;
      }
      break;

    case LL_RCC_ICLK_CLKSOURCE_HSE:  /* USB Clock is HSE */
      if (LL_RCC_HSE_IsReady() != 0U)
      {
        usb_frequency = HSE_VALUE;
      }
      break;

    default:
      /* unreachable code */
      break;
  }
  if (LL_RCC_GetUSBClockSource(USBxSource) == LL_RCC_USB1_CLKSOURCE_ICLKDIV2)
  {
    usb_frequency /= 2U;
  }

  return (usb_frequency);
}

/**
  * @brief  Return SDMMCx clock frequency
  * @param  SDMMCxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_SDMMC1_CLKSOURCE
  * @retval SDMMC clock frequency (in Hz)
  *         - @ref  LL_RCC_PERIPH_FREQUENCY_NO indicates error
  */
uint32_t LL_RCC_GetSDMMCClockFreq(uint32_t SDMMCxSource)
{
  uint32_t SDMMC_frequency = LL_RCC_PERIPH_FREQUENCY_NO;

  assert_param(IS_LL_RCC_SDMMC_CLKSOURCE(SDMMCxSource));

  /* SDMMC CLK clock frequency */
  switch (LL_RCC_GetICLKClockSource(LL_RCC_ICLK_CLKSOURCE))
  {
    case LL_RCC_ICLK_CLKSOURCE_SYSCLK: /* SDMMC Clock is SYSCLK */
      SDMMC_frequency = RCC_GetSystemClockFreq();
      break;

    case LL_RCC_ICLK_CLKSOURCE_MSIK:  /* SDMMC Clock is MSIK */
      if (LL_RCC_MSIK_IsReady() != 0U)
      {
        SDMMC_frequency = RCC_GetMSIKClockFreq();
      }
      break;

    case LL_RCC_ICLK_CLKSOURCE_HSI48:  /* SDMMC Clock is HSI48 */
      if (LL_RCC_HSI48_IsReady() != 0U)
      {
        SDMMC_frequency = HSI48_VALUE;
      }
      break;

    case LL_RCC_ICLK_CLKSOURCE_HSE:  /* SDMMC Clock is HSE */
      if (LL_RCC_HSE_IsReady() != 0U)
      {
        SDMMC_frequency = HSE_VALUE;
      }
      break;

    default:
      /* unreachable code */
      break;
  }

  return (SDMMC_frequency);
}

/**
  * @brief  Return I2Cx clock frequency
  * @param  I2CxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_I2C1_CLKSOURCE
  *         @arg @ref LL_RCC_I2C2_CLKSOURCE
  *         @arg @ref LL_RCC_I2C3_CLKSOURCE
  *         @arg @ref LL_RCC_I2C4_CLKSOURCE
  * @retval I2C clock frequency (in Hz)
  *         - @ref  LL_RCC_PERIPH_FREQUENCY_NO indicates error
  */
uint32_t LL_RCC_GetI2CClockFreq(uint32_t I2CxSource)
{
  uint32_t i2c_frequency = LL_RCC_PERIPH_FREQUENCY_NO;

