stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Src/stm32u3xx_ll_rcc.c
  assert_param(IS_LL_RCC_I2C_CLKSOURCE(I2CxSource));

  if (I2CxSource == LL_RCC_I2C1_CLKSOURCE)
  {
    /* I2C3 CLK clock frequency */
    switch (LL_RCC_GetI2CClockSource(I2CxSource))
    {
      case LL_RCC_I2C1_CLKSOURCE_MSIK: /* I2C3 Clock is MSIK Clock */
        if (LL_RCC_MSIK_IsReady() != 0U)
        {
          i2c_frequency = RCC_GetMSIKClockFreq();
        }
        break;

      case LL_RCC_I2C1_CLKSOURCE_PCLK1:  /* I2C3 Clock is PCLK1 */
        i2c_frequency = RCC_GetPCLK1ClockFreq(RCC_GetHCLKClockFreq(RCC_GetSystemClockFreq()));
        break;

      default:
        /* unreachable code */
        break;
    }
  }
  else if (I2CxSource == LL_RCC_I2C2_CLKSOURCE)
  {
    /* I2C3 CLK clock frequency */
    switch (LL_RCC_GetI2CClockSource(I2CxSource))
    {
      case LL_RCC_I2C2_CLKSOURCE_MSIK: /* I2C3 Clock is MSIK Clock */
        if (LL_RCC_MSIK_IsReady() != 0U)
        {
          i2c_frequency = RCC_GetMSIKClockFreq();
        }
        break;

      case LL_RCC_I2C2_CLKSOURCE_PCLK1:  /* I2C3 Clock is PCLK1 */
        i2c_frequency = RCC_GetPCLK1ClockFreq(RCC_GetHCLKClockFreq(RCC_GetSystemClockFreq()));
        break;

      default:
        /* unreachable code */
        break;
    }
  }
#if defined(I2C4)
  else if (I2CxSource == LL_RCC_I2C4_CLKSOURCE)
  {
    /* I2C3 CLK clock frequency */
    switch (LL_RCC_GetI2CClockSource(I2CxSource))
    {
      case LL_RCC_I2C4_CLKSOURCE_MSIK: /* I2C4 Clock is MSIK Clock */
        if (LL_RCC_MSIK_IsReady() != 0U)
        {
          i2c_frequency = RCC_GetMSIKClockFreq();
        }
        break;

      case LL_RCC_I2C4_CLKSOURCE_PCLK1:  /* I2C4 Clock is PCLK1 */
        i2c_frequency = RCC_GetPCLK1ClockFreq(RCC_GetHCLKClockFreq(RCC_GetSystemClockFreq()));
        break;

      default:
        /* unreachable code */
        break;
    }
  }
#endif /* I2C4 */
  else /*if (I2CxSource == LL_RCC_I2C3_CLKSOURCE)*/
  {
    /* I2C3 CLK clock frequency */
    switch (LL_RCC_GetI2CClockSource(I2CxSource))
    {
      case LL_RCC_I2C3_CLKSOURCE_MSIK: /* I2C3 Clock is MSIK Clock */
        if (LL_RCC_MSIK_IsReady() != 0U)
        {
          i2c_frequency = RCC_GetMSIKClockFreq();
        }
        break;

      case LL_RCC_I2C3_CLKSOURCE_PCLK3:  /* I2C3 Clock is PCLK3 */
        i2c_frequency = RCC_GetPCLK3ClockFreq(RCC_GetHCLKClockFreq(RCC_GetSystemClockFreq()));
        break;

      default:
        /* unreachable code */
        break;
    }
  }
  return i2c_frequency;
}

/**
  * @brief  Return I3Cx clock frequency
  * @param  I3CxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_I3C1_CLKSOURCE
  *         @arg @ref LL_RCC_I3C2_CLKSOURCE
  * @retval I3C clock frequency (in Hz)
  *         - @ref  LL_RCC_PERIPH_FREQUENCY_NO indicates error
  */
uint32_t LL_RCC_GetI3CClockFreq(uint32_t I3CxSource)
{
  uint32_t I3C_frequency = LL_RCC_PERIPH_FREQUENCY_NO;

  assert_param(IS_LL_RCC_I3C_CLKSOURCE(I3CxSource));

  if (I3CxSource == LL_RCC_I3C1_CLKSOURCE)
  {
    /* I3C3 CLK clock frequency */
    switch (LL_RCC_GetI3CClockSource(I3CxSource))
    {
      case LL_RCC_I3C1_CLKSOURCE_MSIK: /* I3C3 Clock is MSIK Clock */
        if (LL_RCC_MSIK_IsReady() != 0U)
        {
          I3C_frequency = RCC_GetMSIKClockFreq();
        }
        break;

      case LL_RCC_I3C1_CLKSOURCE_PCLK1:  /* I3C3 Clock is PCLK1 */
        I3C_frequency = RCC_GetPCLK1ClockFreq(RCC_GetHCLKClockFreq(RCC_GetSystemClockFreq()));
        break;

      default:
        /* unreachable code */
        break;
    }
  }
  else /* I3CxSource = LL_RCC_I3C2_CLKSOURCE */
  {
    /* I3C3 CLK clock frequency */
    switch (LL_RCC_GetI3CClockSource(I3CxSource))
    {
      case LL_RCC_I3C2_CLKSOURCE_MSIK: /* I3C2 Clock is MSIK Clock */
        if (LL_RCC_MSIK_IsReady() != 0U)
        {
          I3C_frequency = RCC_GetMSIKClockFreq();
        }
        break;

      case LL_RCC_I3C2_CLKSOURCE_PCLK2:  /* I3C2 Clock is PCLK2 */
        I3C_frequency = RCC_GetPCLK2ClockFreq(RCC_GetHCLKClockFreq(RCC_GetSystemClockFreq()));
        break;

      default:
        /* unreachable code */
        break;
    }
  }
  return I3C_frequency;
}

/**
  * @brief  Return LPTIMx clock frequency
  * @param  LPTIMxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_LPTIM1_CLKSOURCE
  *         @arg @ref LL_RCC_LPTIM2_CLKSOURCE
  *         @arg @ref LL_RCC_LPTIM34_CLKSOURCE
  * @retval LPTIM clock frequency (in Hz)
  *         - @ref  LL_RCC_PERIPH_FREQUENCY_NO indicates that oscillator (HSI16, LSI or LSE) is not ready
  */
uint32_t LL_RCC_GetLPTIMClockFreq(uint32_t LPTIMxSource)
{
  uint32_t lptim_frequency = LL_RCC_PERIPH_FREQUENCY_NO;

  assert_param(IS_LL_RCC_LPTIM_CLKSOURCE(LPTIMxSource));

  if (LPTIMxSource == LL_RCC_LPTIM1_CLKSOURCE)
  {
    /* LPTIM1CLK clock frequency */
    switch (LL_RCC_GetLPTIMClockSource(LPTIMxSource))
    {
      case LL_RCC_LPTIM1_CLKSOURCE_LSI:    /* LPTIM1 Clock is LSI Osc. */
        if (LL_RCC_LSI_IsReady() != 0U)
        {
          lptim_frequency = LSI_VALUE;
          if (LL_RCC_LSI_GetClockPrediv() == LL_RCC_LSI_PREDIV_128)
          {
            lptim_frequency /= 128U;
          }
        }
        break;

      case LL_RCC_LPTIM1_CLKSOURCE_HSI16:    /* LPTIM1 Clock is HSI16 Osc. */
        if (LL_RCC_HSI_IsReady() != 0U)
        {
          lptim_frequency = HSI_VALUE;
        }
        break;

      case LL_RCC_LPTIM1_CLKSOURCE_LSE:    /* LPTIM1 Clock is LSE Osc. */
        if (LL_RCC_LSE_IsReady() != 0U)
        {
          lptim_frequency = LSE_VALUE;
        }
        break;

      case LL_RCC_LPTIM1_CLKSOURCE_MSIK:  /* LPTIM1 Clock is MSIK */
        if (LL_RCC_MSIK_IsReady() != 0U)
        {
          lptim_frequency = RCC_GetMSIKClockFreq();
        }
        break;

      default:
        /* unreachable code */
        break;
    }
  }
  else if (LPTIMxSource == LL_RCC_LPTIM2_CLKSOURCE)
  {
    /* LPTIM2CLK clock frequency */
    switch (LL_RCC_GetLPTIMClockSource(LPTIMxSource))
    {
      case LL_RCC_LPTIM2_CLKSOURCE_LSI:    /* LPTIM2 Clock is LSI Osc. */
        if (LL_RCC_LSI_IsReady() != 0U)
        {
          lptim_frequency = LSI_VALUE;
          if (LL_RCC_LSI_GetClockPrediv() == LL_RCC_LSI_PREDIV_128)
          {
            lptim_frequency /= 128U;
          }
        }
        break;

      case LL_RCC_LPTIM2_CLKSOURCE_HSI16:    /* LPTIM2 Clock is HSI16 Osc. */
        if (LL_RCC_HSI_IsReady() != 0U)
        {
          lptim_frequency = HSI_VALUE;
        }
        break;

      case LL_RCC_LPTIM2_CLKSOURCE_LSE:    /* LPTIM2 Clock is LSE Osc. */
        if (LL_RCC_LSE_IsReady() != 0U)
        {
          lptim_frequency = LSE_VALUE;
        }
        break;

      case LL_RCC_LPTIM2_CLKSOURCE_PCLK1:  /* LPTIM2 Clock is PCLK1 */
        lptim_frequency = RCC_GetPCLK1ClockFreq(RCC_GetHCLKClockFreq(RCC_GetSystemClockFreq()));
        break;

      default:
        /* unreachable code */
        break;
    }
  }
  else /* LPTIMxSource = LL_RCC_LPTIM34_CLKSOURCE */
  {
    /* LPTIM34CLK clock frequency */
    switch (LL_RCC_GetLPTIMClockSource(LPTIMxSource))
    {
      case LL_RCC_LPTIM34_CLKSOURCE_LSI:    /* LPTIM34 Clock is LSI Osc. */
        if (LL_RCC_LSI_IsReady() != 0U)
        {
          lptim_frequency = LSI_VALUE;
          if (LL_RCC_LSI_GetClockPrediv() == LL_RCC_LSI_PREDIV_128)
          {
            lptim_frequency /= 128U;
          }
        }
        break;

      case LL_RCC_LPTIM34_CLKSOURCE_HSI16:    /* LPTIM34 Clock is HSI16 Osc. */
        if (LL_RCC_HSI_IsReady() != 0U)
        {
          lptim_frequency = HSI_VALUE;
        }
        break;

      case LL_RCC_LPTIM34_CLKSOURCE_LSE:    /* LPTIM34 Clock is LSE Osc. */
        if (LL_RCC_LSE_IsReady() != 0U)
        {
          lptim_frequency = LSE_VALUE;
        }
        break;

      case LL_RCC_LPTIM34_CLKSOURCE_MSIK:  /* LPTIM34 Clock is PCLK1 */
        if (LL_RCC_MSIK_IsReady() != 0U)
        {
          lptim_frequency = RCC_GetMSIKClockFreq();
        }
        break;

      default:
        /* unreachable code */
        break;
    }
  }
  return lptim_frequency;
}

/**
  * @brief  Return RTCx clock frequency
  * @param  RTCxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_RTC_CLKSOURCE
  * @retval RTC clock frequency (in Hz)
  *         - @ref  LL_RCC_PERIPH_FREQUENCY_NO indicates that oscillator (HSE, LSI or LSE) is not ready
  */
uint32_t LL_RCC_GetRTCClockFreq(uint32_t RTCxSource)
{
  uint32_t rtc_frequency = LL_RCC_PERIPH_FREQUENCY_NO;

  assert_param(IS_LL_RCC_RTC_CLKSOURCE(RTCxSource));

  /* RTC CLK clock frequency */
  switch (LL_RCC_GetRTCClockSource(RTCxSource))
  {
    case LL_RCC_RTC_CLKSOURCE_LSE:        /* LSE clock used as RTC clock source */
      if (LL_RCC_LSE_IsReady() != 0U)
      {
        rtc_frequency = LSE_VALUE;
      }
      break;

    case LL_RCC_RTC_CLKSOURCE_LSI:        /* LSI clock used as RTC clock source */
      if (LL_RCC_LSI_IsReady() != 0U)
      {
        rtc_frequency = LSI_VALUE;
        if (LL_RCC_LSI_GetClockPrediv() == LL_RCC_LSI_PREDIV_128)
        {
          rtc_frequency /= 128U;
        }
      }
      break;

    case LL_RCC_RTC_CLKSOURCE_HSE_DIV32:        /* HSE/32 clock used as RTC clock source */
      if (LL_RCC_HSE_IsReady() != 0U)
      {
        rtc_frequency = HSE_VALUE / 32U;
      }
      break;

    case LL_RCC_RTC_CLKSOURCE_NONE:
    default:
      /* unreachable code */
      break;
  }
  return rtc_frequency;
}

/**
  * @brief  Return SAIx clock frequency
  * @param  SAIxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_SAI1_CLKSOURCE
  * @retval SAI clock frequency (in Hz)
  *         - @ref  LL_RCC_PERIPH_FREQUENCY_NO indicates that MSIK or HSE is not ready
  */
uint32_t LL_RCC_GetSAIClockFreq(uint32_t SAIxSource)
{
  uint32_t sai_frequency = LL_RCC_PERIPH_FREQUENCY_NO;

  assert_param(IS_LL_RCC_SAI_CLKSOURCE(SAIxSource));

  /* SAI1CLK clock frequency */
  switch (LL_RCC_GetSAIClockSource(SAIxSource))
  {
    case LL_RCC_SAI1_CLKSOURCE_MSIK:        /* MSIK clock used as SAI1 clock source */
      if (LL_RCC_MSIK_IsReady() != 0U)
      {
        sai_frequency = RCC_GetMSIKClockFreq();
      }
      break;

    case LL_RCC_SAI1_CLKSOURCE_AUDCLKIN:         /* External input clock used as SAI1 clock source */
      sai_frequency = EXTERNAL_AUDIO_CLOCK_VALUE;
      break;

    case LL_RCC_SAI1_CLKSOURCE_HSE:        /* SAI Clock is HSE Osc. */
      if (LL_RCC_HSE_IsReady() != 0U)
      {
        sai_frequency = HSE_VALUE;
      }
      break;

    default:
      /* unreachable code */
      break;
  }

  return sai_frequency;
}

/**
  * @brief  Return ADFx clock frequency
  * @param  ADFxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_ADF1_CLKSOURCE
  * @retval ADF clock frequency (in Hz)
  *         - @ref  LL_RCC_PERIPH_FREQUENCY_NO indicates that MSIK or HSE is not ready
  */
uint32_t LL_RCC_GetADFClockFreq(uint32_t ADFxSource)
{
  uint32_t adf_frequency = LL_RCC_PERIPH_FREQUENCY_NO;

  assert_param(IS_LL_RCC_ADF_CLKSOURCE(ADFxSource));

  /* ADF1CLK clock frequency */
  switch (LL_RCC_GetADFClockSource(ADFxSource))
  {
    case LL_RCC_ADF1_CLKSOURCE_MSIK:        /* MSIK clock used as ADF1 clock source */
      if (LL_RCC_MSIK_IsReady() != 0U)
      {
        adf_frequency = RCC_GetMSIKClockFreq();
      }
      break;

    case LL_RCC_ADF1_CLKSOURCE_AUDCLKIN:         /* External input clock used as ADF1 clock source */
      adf_frequency = EXTERNAL_AUDIO_CLOCK_VALUE;
      break;

