stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Src/stm32u3xx_ll_rcc.c
    case LL_RCC_ADF1_CLKSOURCE_SAI1:        /* ADF Clock is SAI1 clock */
      adf_frequency = LL_RCC_GetSAIClockFreq(LL_RCC_SAI1_CLKSOURCE);
      break;

    default:
      /* unreachable code */
      break;
  }

  return adf_frequency;
}

/**
  * @brief  Return RNGx clock frequency
  * @param  RNGxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_RNG_CLKSOURCE
  * @retval RNG clock frequency (in Hz)
  *         - @ref  LL_RCC_PERIPH_FREQUENCY_NO indicates that oscillator (HSI48) or MSIK is not ready
  */
uint32_t LL_RCC_GetRNGClockFreq(uint32_t RNGxSource)
{
  uint32_t rng_frequency = LL_RCC_PERIPH_FREQUENCY_NO;

  assert_param(IS_LL_RCC_RNG_CLKSOURCE(RNGxSource));

  /* RNGCLK clock frequency */
  switch (LL_RCC_GetRNGClockSource(RNGxSource))
  {
    case LL_RCC_RNG_CLKSOURCE_HSI48:            /* HSI48 clock used as RNG clock source */
      if (LL_RCC_HSI48_IsReady() != 0U)
      {
        rng_frequency = HSI48_VALUE;
      }
      break;
    case LL_RCC_RNG_CLKSOURCE_MSIK:            /* MSIK clock used as RNG clock source */
      if (LL_RCC_MSIK_IsReady() != 0U)
      {
        rng_frequency = RCC_GetMSIKClockFreq();
      }
      break;

    default:
      /* unreachable code */
      break;
  }
  return rng_frequency;
}

/**
  * @brief  Return ADCDACx clock frequency
  * @param  ADCDACxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_ADCDAC_CLKSOURCE
  * @retval ADC clock frequency (in Hz)
  *         - @ref  LL_RCC_PERIPH_FREQUENCY_NO indicates that oscillator (HSE) or MSIK is not ready
  */
uint32_t LL_RCC_GetADCDACClockFreq(uint32_t ADCDACxSource)
{
  uint32_t adcdac_frequency = LL_RCC_PERIPH_FREQUENCY_NO;

  assert_param(IS_LL_RCC_ADCDAC_CLKSOURCE(ADCDACxSource));

  /* ADCDACCLK clock frequency */
  switch (LL_RCC_GetADCDACClockSource(ADCDACxSource))
  {
    case LL_RCC_ADCDAC_CLKSOURCE_HCLK:         /* ADCDAC Clock is SYSCLK */
      adcdac_frequency = RCC_GetHCLKClockFreq(RCC_GetSystemClockFreq());
      break;
    case LL_RCC_ADCDAC_CLKSOURCE_HSE:           /* HSE clock used as ADC clock source */
      if (LL_RCC_HSE_IsReady() != 0U)
      {
        adcdac_frequency = HSE_VALUE;
      }
      break;
    case LL_RCC_ADCDAC_CLKSOURCE_MSIK:           /* MSIK clock used as ADC clock source */
      if (LL_RCC_MSIK_IsReady() != 0U)
      {
        adcdac_frequency = RCC_GetMSIKClockFreq();
      }
      break;
    default:
      /* unreachable code */
      break;
  }

  if (adcdac_frequency != LL_RCC_PERIPH_FREQUENCY_NO)
  {
    switch (LL_RCC_GetADCDACClockPrescaler(LL_RCC_ADCDAC_CLKPRESCALER))
    {
      case LL_RCC_ADCDAC_CLKPRESCALER_ICLK_DIV_2:
        adcdac_frequency /= 2U;
        break;
      case LL_RCC_ADCDAC_CLKPRESCALER_ICLK_DIV_4:
        adcdac_frequency /= 4U;
        break;
      case LL_RCC_ADCDAC_CLKPRESCALER_ICLK_DIV_8:
        adcdac_frequency /= 8U;
        break;
      case LL_RCC_ADCDAC_CLKPRESCALER_ICLK_DIV_16:
        adcdac_frequency /= 16U;
        break;
      case LL_RCC_ADCDAC_CLKPRESCALER_ICLK_DIV_32:
        adcdac_frequency /= 32U;
        break;
      case LL_RCC_ADCDAC_CLKPRESCALER_ICLK_DIV_64:
        adcdac_frequency /= 64U;
        break;
      case LL_RCC_ADCDAC_CLKPRESCALER_ICLK_DIV_128:
        adcdac_frequency /= 128U;
        break;
      case LL_RCC_ADCDAC_CLKPRESCALER_ICLK_DIV_256:
        adcdac_frequency /= 256U;
        break;
      case LL_RCC_ADCDAC_CLKPRESCALER_ICLK_DIV_512:
        adcdac_frequency /= 512U;
        break;
      case LL_RCC_ADCDAC_CLKPRESCALER_ICLK:
      default:
        /* No division */
        break;
    }
  }
  return adcdac_frequency;
}

/**
  * @brief  Return DACSHx clock frequency
  * @param  DACSHxSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_DAC1SH_CLKSOURCE
  * @retval DACSH clock frequency (in Hz)
  *         - @ref  LL_RCC_PERIPH_FREQUENCY_NO indicates that error occurred
  */
uint32_t LL_RCC_GetDACSHClockFreq(uint32_t DACSHxSource)
{
  uint32_t dacsh_frequency = LL_RCC_PERIPH_FREQUENCY_NO;

  assert_param(IS_LL_RCC_DAC1SH_CLKSOURCE(DACSHxSource));

  /* DACSHCLK clock frequency */
  switch (LL_RCC_GetDACSHClockSource(DACSHxSource))
  {
    case LL_RCC_DAC1SH_CLKSOURCE_LSE:        /* LSE clock used as DAC1SH clock source */
      if (LL_RCC_LSE_IsReady() != 0U)
      {
        dacsh_frequency = LSE_VALUE;
      }
      break;

    case LL_RCC_DAC1SH_CLKSOURCE_LSI:        /* LSI clock used as DAC1SH clock source */
      if (LL_RCC_LSI_IsReady() != 0U)
      {
        dacsh_frequency = LSI_VALUE;
        if (LL_RCC_LSI_GetClockPrediv() == LL_RCC_LSI_PREDIV_128)
        {
          dacsh_frequency /= 128U;
        }
      }
      break;

    default:
      /* unreachable code */
      break;
  }
  return dacsh_frequency;
}

/**
  * @}
  */

/**
  * @}
  */

/** @addtogroup RCC_LL_Private_Functions
  * @{
  */

/**
  * @brief  Return SYSTEM clock frequency
  * @retval SYSTEM clock frequency (in Hz)
  */
static uint32_t RCC_GetSystemClockFreq(void)
{
  uint32_t frequency;

  switch (LL_RCC_GetSysClkSource())
  {
    case LL_RCC_SYS_CLKSOURCE_HSE:   /* HSE used as system clock  source */
      frequency = HSE_VALUE;
      break;

    case LL_RCC_SYS_CLKSOURCE_MSIS:  /* MSIS used as system clock  source */
      frequency = RCC_GetMSISClockFreq();
      break;

    case LL_RCC_SYS_CLKSOURCE_HSI16:   /* HSI used as system clock  source */
    default:
      frequency = HSI_VALUE;
      break;
  }

  return frequency;
}

/**
  * @brief  Return HCLK clock frequency
  * @param  SYSCLK_Frequency SYSCLK clock frequency
  * @retval HCLK clock frequency (in Hz)
  */
static uint32_t RCC_GetHCLKClockFreq(uint32_t SYSCLK_Frequency)
{
  /* HCLK clock frequency */
  return __LL_RCC_CALC_HCLK_FREQ(SYSCLK_Frequency, LL_RCC_GetAHBPrescaler());
}

/**
  * @brief  Return PCLK1 clock frequency
  * @param  HCLK_Frequency HCLK clock frequency
  * @retval PCLK1 clock frequency (in Hz)
  */
static uint32_t RCC_GetPCLK1ClockFreq(uint32_t HCLK_Frequency)
{
  /* PCLK1 clock frequency */
  return __LL_RCC_CALC_PCLK1_FREQ(HCLK_Frequency, LL_RCC_GetAPB1Prescaler());
}

/**
  * @brief  Return PCLK2 clock frequency
  * @param  HCLK_Frequency HCLK clock frequency
  * @retval PCLK2 clock frequency (in Hz)
  */
static uint32_t RCC_GetPCLK2ClockFreq(uint32_t HCLK_Frequency)
{
  /* PCLK2 clock frequency */
  return __LL_RCC_CALC_PCLK2_FREQ(HCLK_Frequency, LL_RCC_GetAPB2Prescaler());
}


/**
  * @brief  Return PCLK3 clock frequency
  * @param  HCLK_Frequency HCLK clock frequency
  * @retval PCLK3 clock frequency (in Hz)
  */
static uint32_t RCC_GetPCLK3ClockFreq(uint32_t HCLK_Frequency)
{
  /* PCLK3 clock frequency */
  return __LL_RCC_CALC_PCLK3_FREQ(HCLK_Frequency, LL_RCC_GetAPB3Prescaler());
}

/**
  * @brief  Return MSIS clock frequency
  * @retval MSIS clock frequency (in Hz)
  */
static uint32_t RCC_GetMSISClockFreq(void)
{
  uint32_t frequency = MSIRC1_VALUE;

  if (LL_RCC_MSIS_GetClockSource() == LL_RCC_MSIS_CLOCK_SOURCE_RC0)
  {
    frequency = MSIRC0_VALUE;
  }
  switch (LL_RCC_MSIS_GetClockDivision())
  {
    case LL_RCC_MSIS_CLOCK_SOURCE_RC_DIV_2:
      frequency /= 2U;
      break;
    case LL_RCC_MSIS_CLOCK_SOURCE_RC_DIV_4:
      frequency /= 4U;
      break;
    case LL_RCC_MSIS_CLOCK_SOURCE_RC_DIV_8:
      frequency /= 8U;
      break;
    case LL_RCC_MSIS_CLOCK_SOURCE_RC_DIV_1:
    default:
      /* no division */
      break;
  }

  return frequency;
}

/**
  * @brief  Return MSIK clock frequency
  * @retval MSIK clock frequency (in Hz)
  */
static uint32_t RCC_GetMSIKClockFreq(void)
{
  uint32_t frequency = MSIRC1_VALUE;

  if (LL_RCC_MSIK_GetClockSource() == LL_RCC_MSIK_CLOCK_SOURCE_RC0)
  {
    frequency = MSIRC0_VALUE;
  }
  switch (LL_RCC_MSIK_GetClockDivision())
  {
    case LL_RCC_MSIK_CLOCK_SOURCE_RC_DIV_2:
      frequency /= 2U;
      break;
    case LL_RCC_MSIK_CLOCK_SOURCE_RC_DIV_4:
      frequency /= 4U;
      break;
    case LL_RCC_MSIK_CLOCK_SOURCE_RC_DIV_8:
      frequency /= 8U;
      break;
    case LL_RCC_MSIK_CLOCK_SOURCE_RC_DIV_1:
    default:
      /* no division */
      break;
  }

  return frequency;
}

/**
  * @}
  */

/**
  * @}
  */

#endif /* defined(RCC) */

/**
  * @}
  */

#endif /* USE_FULL_LL_DRIVER */
